{
  "name": "Rafael Frank",
  "role": "Staff Software Engineer",
  "description": "**13+ years of experience** in distributed systems and fullstack development. **Staff Software Engineer** driving **technical strategy**, **cross-team architecture**, and engineering quality across high-scale, mission-critical platforms (AWS, Kubernetes, Golang). Proven success in reliability improvements (e.g., reducing data loss from 4% to 0.03%) and elevating organizational engineering standards (RFCs, Mentorship).",
  "email": "rafael.h.frank@gmail.com",
  "phone": "+49 152 0548 8328",
  "location": "Berlin, Germany",
  "githubUrl": "https://github.com/frankra",
  "linkedinUrl": "https://linkedin.com/in/frankra",
  "webUrl": "https://frankra.github.io",
  "coreCompetencies": [
    "Golang",
    "Node JS",
    "Typescript",
    "AWS (EC2, SQS/SNS, RDS)",
    "Kubernetes",
    "Microservices",
    "Distributed Systems (SAGA, Outbox Pattern)",
    "Clean Architecture",
    "MySQL",
    "Postgres",
    "Redis"
  ],
  "experiences": [
    {
      "role": "Staff Software Engineer",
      "company": "Delivery Hero",
      "from": "01/2023",
      "to": "Present",
      "location": "Berlin, Germany",
      "description": "Leading the vendor data management squad, responsible for the high-scale, core entry point and source of truth for vendor data across the platform, handling **millions of requests daily**.",
      "skills": [
        "Golang",
        "AWS",
        "Mysql",
        "Kubernetes",
        "SQS/SNS",
        "Redis",
        "Microservices",
        "Distributed Systems",
        "System Design (RFC)",
        "Clean Architecture",
        "SOLID Principles",
        "Parallel Programming"
      ],
      "activities": [
        {
          "description": "Authored and presented organization-wide design documents (RFCs), detailing technical strategy for complex systems, including the **Transactional Outbox pattern**, an **Idempotent SQS Consumer framework**, and a solution for handling distributed transactions using the **SAGA pattern**."
        },
        {
          "description": "Investigated and identified a major technical debt issue in vendor availability causing unintended downtime, quantifying the potential business loss at **~5 million EUR annually**. Drove a strategic resolution by leading the **cross-team migration** of the high-impact logic to the Logistics team's stack."
        },
        {
          "description": "Architected and implemented a generic and reusable **concurrent SQS idempotent consumer** framework, utilizing row-level locks to ensure sequential processing for single entities while maximizing parallel throughput."
        },
        {
          "description": "Led a major refactoring of core services, **substantially improving the development experience** and **reducing the amount of weekly support requests by half**."
        },
        {
          "description": "Drove engineering quality standards by acting as the squad's technical mentor (SOLID, Clean Arch) and **improved system reliability** by enhancing observability and producing runbooks, expediting mitigation of major incidents."
        },
        {
          "description": "Reworked the notifications framework of the core service, dramatically **reducing the error rate and critical data loss from 4% to 0.03%**."
        }
      ]
    },
    {
      "role": "Lead Software Engineer",
      "company": "Log-hub AG",
      "from": "11/2021",
      "to": "11/2022",
      "location": "Berlin, Germany",
      "description": "Worked on the development of a supply chain analytics and optimization platform with collaboration and automation features.",
      "skills": [
        "Node JS",
        "Typescript",
        "Angular",
        "MongoDB",
        "Redis",
        "Kubernetes",
        "Azure",
        "AWS SQS",
        "Python",
        "Websockets",
        "Architecture",
        "Docker",
        "DevOps/CI/CD",
        "SCRUM/Agile"
      ],
      "activities": [
        {
          "description": "Architected, designed, and led the development team to build a supply chain analytics platform, integrating existing optimization applications with collaboration and automation features."
        },
        {
          "description": "Implemented critical engineering processes (SCRUM, code reviews, PRs, product roadmap planning), greatly increasing team efficiency and deliverables quality."
        },
        {
          "description": "Dockerized and migrated ~80% of the infrastructure from bare metal to Azure Kubernetes, establishing a foundation for automated continuous releases."
        },
        {
          "description": "Introduced and enforced an automated testing culture, integrating tests into the deployment pipeline to greatly reduce the occurrence of regressions."
        }
      ]
    },
    {
      "role": "Senior Software Engineer",
      "company": "SAP",
      "from": "03/2019",
      "to": "11/2021",
      "location": "Berlin, Germany",
      "description": "Fullstack engineer developing Ruum by SAP, a project management tool with simple process modelling and execution features.",
      "skills": [
        "Node JS",
        "Typescript",
        "Angular",
        "Postgres",
        "Redis",
        "Kubernetes",
        "AWS",
        "OData",
        "API Design",
        "Webhooks"
      ],
      "activities": [
        {
          "description": "Architected and implemented an end-to-end annotation-based OData API framework in NodeJS that drastically reduced the time needed to release new public APIs (estimated 40% time savings)."
        },
        {
          "description": "Architected and developed the complete webhooks system (Fullstack), allowing developers to configure, maintain, and troubleshoot integrations conveniently."
        },
        {
          "description": "Optimized Postgres SQL queries, leading to a significant increase in overall application and public API performance."
        },
        {
          "description": "Architected and developed many fullstack features, flexibly contributing to areas most in need to guarantee stable and steady feature releases."
        }
      ]
    },
    {
      "role": "Software Engineer / Consultant",
      "company": "SAP",
      "from": "08/2012",
      "to": "03/2019",
      "location": "São Leopoldo, Brazil",
      "description": "Worked as a fullstack engineer and consultant, delivering custom tailored cloud solutions for SAP Cloud Platform and SAP Cloud ERP.",
      "skills": [
        "Node JS",
        "Javascript",
        "PHP",
        "Java",
        "AngularJS",
        "D3.js",
        "SAP UI5",
        "SAP Cloud Platform",
        "OData",
        "Consulting",
        "IoT",
        "Project Estimation",
        "Team Leadership"
      ],
      "activities": [
        {
          "description": "Designed, developed, and led teams to deliver 30+ custom extensions on a variety of SAP Cloud ERP modules."
        },
        {
          "description": "Worked closely with 20+ customers and product teams to design cloud solutions and estimate project costs."
        },
        {
          "description": "Designed and developed frontend components and real-time charts for a strategic IoT and predictive maintenance project for a major air compressor provider."
        },
        {
          "description": "Received an **Outstanding Performance Evaluation for 5 years in a row**, demonstrating sustained high-level contribution."
        }
      ]
    },
    {
      "role": "Co-Founder / Fullstack Engineer",
      "company": "Flimbo",
      "from": "03/2015",
      "to": "07/2016",
      "location": "São Leopoldo, Brazil",
      "description": "Co-Founder of a startup focused on creating, maintaining, and sharing marketing content on online social networks.",
      "skills": [
        "Node JS",
        "Javascript",
        "Postgres",
        "MongoDB",
        "AWS",
        "AngularJS",
        "Entrepreneurship",
        "Backend Architecture",
        "Security"
      ],
      "activities": [
        {
          "description": "Designed and developed the backend stack focusing on security, performance, and scalability using NodeJS and Postgres."
        },
        {
          "description": "Assembled and mobilized the initial team of co-founders to further develop the idea, roadmap, and kick-start development."
        },
        {
          "description": "Integrated the application with major social networks, allowing paying users to post content seamlessly."
        }
      ]
    }
  ],
  "awards": [
    {
      "title": "14 Awards for Professionalism and Teamwork",
      "institution": "SAP",
      "location": "São Leopoldo, Brazil",
      "date": "Present",
      "description": "Awarded multiple times by peers for performance in delivering value to customers and teamwork."
    },
    {
      "title": "First Place at UFRGS Entrepreneurship Marathon (Flimbo)",
      "institution": "UFRGS",
      "location": "Porto Alegre, Brazil",
      "date": "2016",
      "description": "Flimbo won as the most innovative and overall most mature startup on the event."
    },
    {
      "title": "Products and Innovation Talent Award",
      "institution": "SAP",
      "location": "São Leopoldo, Brazil",
      "date": "2015",
      "description": "Nominated one of the talents of the year among the worldwide organization."
    }
  ],
  "education": [
    {
      "title": "Software Analysis and Development (Superior - Part-Time Study)",
      "institution": "Universidade do Vale do Rio dos Sinos (Unisinos)",
      "from": "01/2010",
      "to": "12/2017",
      "level": "Superior",
      "location": "São Leopoldo, Brazil",
      "activities": [
        {
          "description": "Thesis focused on clean architecture and dependency injection."
        }
      ]
    }
  ],
  "languages": [
    {
      "name": "Portuguese",
      "proficiency": "Native"
    },
    {
      "name": "English",
      "proficiency": "Proficient (C1)"
    },
    {
      "name": "German",
      "proficiency": "Intermediate (B1)"
    }
  ]
}